{"pages":[{"title":"About","text":"","link":"/about/index.html"},{"title":"Project","text":"","link":"/project/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"2020-11-11-部落格第一篇文","text":"紀念部落格成立藉此篇文紀念部落格的成立! 用 Hexo 架站遇到的雷真的很多…感覺不會比 WordPress 少呀! 但是用 WordPress 不知怎地就是沒有寫文章的動力。 工程師嘛～搞不好就是習慣看編輯器了，反而看著 WordPress 的 GUI 生不出寫文的慾望。 為自己偷懶不寫文開脫 想說那就來試試看 Hexo 好了，撰寫方式是用 Markdown 語法，也是平常記筆記習慣用的寫法。 現在寫這篇文是用 vscode 在寫的。有一種說不出的奇妙感。 總之感謝六角學院的卡斯柏和Ray的教學影片和文章，經歷了一多不知所以然的錯誤，最後還是架站成功了! 關於本部落格筆者本身是日文系出身，轉職網頁設計師，目前在日本打拼，朝著前端工程師的目標努力。 會在這邊記錄自己在學習前端、網頁設計時的筆記和技術文，以及在日本工作、生活的心得，或是一些雜談。","link":"/2020/11/11/2020-11-11-%E9%83%A8%E8%90%BD%E6%A0%BC%E7%AC%AC%E4%B8%80%E7%AF%87%E6%96%87/"},{"title":"羅生門(電影)觀後感","text":"前言很有名的羅生門卻一直沒機會看，剛好 Netflix 上有播就來這個經典作品，搭配日文字幕來看。 說真的裡面的演員可能為了詮釋角色的個性，語速都超快、又口齒不清，單純用聽的還真的是聽不懂呀… 每個人都在說謊? 要想生存即是如此 真相被謊言所蒙蔽，每個角色都有各自的理由，為了自己的利益、名譽。實際上這類事情卻是在日常生活上每天都會發生的，甚而是不得已而為之。 以自己的方便為優先，修飾說詞。掩蓋對自己不利的事證，強調對自己有利的事證。卻也是一件再正常不過的事情，甚至是每個人都在做的。 就好比你去面試，一定也是只會針對自己有利的地方講。甚至面試教學也會建議你即使前公司再不好，也絕對不要講前公司的壞話，不然現在的公司會認為你以後也會講他們的壞話云云。或甚至是被問到是否能夠接受加班，也要背著本性說絕對沒有問題。 男生要追女生，也是要先表現得我很誠懇、很溫柔，非你不可，才會讓女生答應交往。最後感情過了一段時間，男生疏於照顧關係或是顯露本性。最後女生抱怨「他原本不是這個樣子的!」，哼哼~但是，真的要確定兩人合得來是需要花一大段時間才會知道的，男生跟女生個性真的合得來的也沒有那麼多吧絕大多數要成功交往，除了兩人的契合度外，還是要靠一個衝動，積極打破現狀的舉止出來。不然就是要嘛停在朋友關係，要嘛女生的感覺冷掉了，要嘛就是花了很多時間才發現不合，背後的時間成本和力氣付諸流水…云云所以男生希望交到女友為前提而言，在策略上不得不這麼做。不過你這些把實話全說出口，大概就交不到女友啦。 社會上殘酷的是，即使我想要說實話，也不得不顧及其他人對我的看法。他人對我的印象，在內心產生歧見，就會顯露在對我的態度和行為上，而我的人際關係受到考驗，甚至可能影響到事業及生活。要戴上面具的原因也是因為周圍的人會有偏見、愛說閒話。人與人之間的相處，終究無法把自己想說的照原樣說出來。 對應到電影最後，告發者被發現偷走了價值不斐的短匕首，被陌生人笑道「你既然偷了你也是小偷不是嗎?」只能不發一語(題外話，我的想法反而是應該依照情況不同來做判斷。那把短匕首反正也用不到了，用它換來的金錢來照顧他的6個孩子，反而還發揮了它的用處。)對於是非對錯的判斷基準我認為是變動的、相對的；而不是絕對、一成不變的。在最一開始的基礎點，以「偷東西 = 小偷」給了一個人小偷的標籤之後，很容易就陷入了一個邏輯：「這個人 = 小偷 = 有偷東西的傾向 = 壞人 = 不值得信任。」最後這個人反而被全盤否定了。他的良善的特質也被淹蓋住。 事實到底為何? 試著推理看看———- 防雷線 ———- 我認為作者就是想要給一個開放的想像空間，所以事實是什麼或許在作者心中也是沒有答案的。 但若是硬要做推理，硬要講的話，依照電影當中對於人物的描寫以及任何線索為判斷依據，我傾向於多襄丸以及告發者的說詞較接近真實。 女人證詞我所抱持的存疑：女人受到侵犯雖然受人憐惜，但是對於教唆兩人決一生死這件事情，將可能有損於女人的名譽，所以其決定將這件事情隱藏不說。 往生武士證詞我所抱持的存疑：往生武士承受自己的女人被侵犯以及自己在決鬥中打輸的事實，即使心裡清楚真相，也絕不會把這些屈辱共諸於世，對武士而言，教唆兩人決一生死，或許從他眼裡看來，和女人叫多襄丸把他殺了也相去不遠啦~ 告發者最後義憤填膺地說出自己其實看到了整個過程。但也打臉自己當初在法庭上所說「只看到了武士遺體」，所以在講出「實情」後也被質疑說該不會又再騙人了吧。然而，可以理解他不想被牽扯進事件的心情，且面對無利害關係的陌生人其實更容易將實話說出口，所以最後說詞屬實的可能性不低。 整理一下電影中總共有4個人的說詞 多襄丸聲稱是他殺害了武士。在侵犯女人過後，跑過來抱住她的腿說，「我不能接受自己在兩個男人面前受辱而這樣活下去。今天要不你死就是他死，你們兩個誰活下來我就跟誰走」。多襄丸即解開綁住武士的繩索，兩人展開決鬥後將武士殺死。回過身來，女人已不知跑到何處。 女人聲稱是她用自己的短匕首殺害武士。在被侵犯過後，多襄丸鬆開武士的繩子隨即轉身離去。女人抱著武士痛哭，而武士只是用一種「既不是憤怒也不是悲傷，只是用一種鄙視的眼神」看著她。女人感到非常難過，痛哭說與其用這種眼神看我還不如賜我一死。女人邊痛哭著邊拿起短匕首放在胸前朝前向武士慢慢逼近。「我當下失去意識，但是一回神後就發現匕首已刺進武士身上」女人是這樣說的。 往生武士藉由靈媒附身。聲稱自己在冥界當中非常地痛苦。原因是，多襄丸在侵犯女人後，不停地安撫低著頭的女人，說「一旦妳的身體被玷汙了，妳和丈夫的關係也很難和好了。與其這樣不如當我的妻子吧，我就是因為太喜歡她才會做如此行為。」女人聽完多襄丸的話語後，「她抬起頭來，居然用我從沒看過的美麗樣貌看著多襄丸」武士這樣說「而她另人憎惡的不只是如此，在跟著多襄丸將要離去時，居然轉過頭來要求多襄丸將我殺死」。聽完此話的多襄丸反而把女人推倒在地，詢問武士如何處置這個女人，女人趁隙逃走，而在多襄丸放了武士自由後，武士感到極度難過便自殺了。 告發者最初說他人到事發現場時，早已只剩武士的遺體。而在最後才向陌生人說出自己其實看到了整個過程。多襄丸不停地安撫低著頭的女人。「我很喜歡妳，即使再苦我也會讓妳過著幸福的日子…(略)…但妳如不答應我就不能讓妳活」女人最後停止哭泣，說著不可能。之後跑到丈夫面前將其繩子解開。說「這難道是一介女人可以決定的事?」示意由男人展開決鬥來決定其去留。被解開繩子的武士，起身只說著我可不值得為了這女人賭上自己的性命，怒斥女人說妳被玷汙為何不是以死明志?多襄丸聽完，女人感到氣憤，痛罵多襄丸，「我還以為你多厲害，可以幫助我脫離這個僵局，看來鼎鼎大名的盜賊多襄丸也不過爾爾」，轉頭罵丈夫「既然身為一個男人，你為何不是先將玷汙我的人殺了，再來指責我不以死明志呢?」。隨後兩人展開決鬥，打鬥過程在電影中兩人顯得很狼狽。最終多襄丸殺死了武士，而女人最後逃跑了。","link":"/2020/11/12/2020-11-12-%E7%BE%85%E7%94%9F%E9%96%80%E9%9B%BB%E5%BD%B1%E8%A7%80%E5%BE%8C%E6%84%9F/"}],"tags":[{"name":"測試","slug":"測試","link":"/tags/%E6%B8%AC%E8%A9%A6/"},{"name":"東聊西聊","slug":"東聊西聊","link":"/tags/%E6%9D%B1%E8%81%8A%E8%A5%BF%E8%81%8A/"}],"categories":[{"name":"測試","slug":"測試","link":"/categories/%E6%B8%AC%E8%A9%A6/"},{"name":"東聊西聊","slug":"東聊西聊","link":"/categories/%E6%9D%B1%E8%81%8A%E8%A5%BF%E8%81%8A/"}]}